tutorials/multiform/oilWaxFoam/axialsimmetric/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
   inlet
    {
        type            fixedValue;
        value           uniform 298;
    }

    outlet
    {
        type            zeroGradient;
    }

   walls
    {
        type            fixedValue;
        value           uniform 289;
    }

    axis
    {
      type              empty;
    }
    front
    {
      type            wedge;
      value           $internalField;
    }
    back
    {
      type            wedge;
      value           $internalField;
    }
}

// ************************************************************************* //
