tutorials/multiform/oilWaxFoam/axialsimmetric/0/c.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		    uniform 1;
    }

    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    axis
    {
      type              empty;
    }
    front
    {
      type            wedge;
      value           $internalField;
    }
    back
    {
      type            wedge;
      value           $internalField;
    }

}

// ************************************************************************* //
